<?php

return [

    /*
    |--------------------------------------------------------------------------
    | DictLoader Driver
    |--------------------------------------------------------------------------
    |
    | Supported Drivers:
    | \Jundayw\PinYin\Support\FileDictLoader
    | \Jundayw\PinYin\Support\GeneratorFileDictLoader
    | \Jundayw\PinYin\Support\MemoryFileDictLoader
    |
    | Default:
    | \Jundayw\PinYin\Support\FileDictLoader
    |
    */

    'driver' => null,

    /*
    |--------------------------------------------------------------------------
    | 姓氏处理
    |--------------------------------------------------------------------------
    |
    */

    'surnames' => [
        '单' => '	shàn',
    ],

    /*
    |--------------------------------------------------------------------------
    | 单词处理
    |--------------------------------------------------------------------------
    | 注意：单词处理 优先级 低于 短语处理
    |
    */

    'chars' => [
        '⺁' => '	fǎn',
    ],

    /*
    |--------------------------------------------------------------------------
    | 短语处理
    |--------------------------------------------------------------------------
    | 注意：短语处理 优先级 高于 单词处理
    |
    */

    'words' => [
        '单田芳' => '	shàn	tián	fāng',
        '一路同行' => '	yí	lù	tóng	xíng',
    ],
];
